piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_adcui.c
/**
 *******************************************************************************
 * @file    MDR32VF0xI_adcui.c
 * @author  Milandr Application Team
 * @version V0.2.0
 * @date    20/05/2025
 * @brief   This file contains all the ADCUI firmware functions.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32VF0xI_adcui.h"

/** @addtogroup MDR32VF0xI_StdPeriph_Driver MDR32VF0xI Standard Peripheral Driver
 * @{
 */

/** @defgroup ADCUI ADCUI
 * @{
 */

/** @defgroup ADCUI_Private_Defines ADCUI Private Defines
 * @{
 */

#define IS_ADCUI_SAGLVL(SAGLVL)     ((SAGLVL) <= 0xFFFF)
#define IS_ADCUI_SAGCYC(SAGCYC)     ((SAGCYC) <= 0xFF)
#define IS_ADCUI_ZXTOUT(ZXTOUT)     ((ZXTOUT) <= 0xFFF)

#define IS_ADCUI_FXPHASE(PHASE)     (((PHASE) >= -126) && ((PHASE) <= 127))
#define IS_ADCUI_FXVIRMSOS(UIRMSOS) ((UIRMSOS) <= 0xFFF)

#define IS_ADCUI_FXPWRGAIN(PWRGAIN) ((PWRGAIN) <= 0xFFF)
#define IS_ADCUI_FXPWROS(PWROS)     ((PWROS) <= 0xFFFF)

#define IS_ADCUI_FXVIPKLVL(LVL)     ((LVL) <= 0xFFFF)

#if defined(USE_MDR32F02_REV_1X)
#define IS_ADCUI_CCAL_GAIN(GAIN) ((GAIN) <= 0xFFF)
#endif

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
#define IS_ADCUI_CCAL_GAIN(GAIN) ((GAIN) <= 0xFFFF)
#endif

#define DEINIT_FLAGS0 (ADCUI_F0STAT_F0VF_OVR |  \
                       ADCUI_F0STAT_F0IF_OVR |  \
                       ADCUI_F0STAT_F0SAGF |    \
                       ADCUI_F0STAT_F0PEAKVF |  \
                       ADCUI_F0STAT_F0PEAKIF |  \
                       ADCUI_F0STAT_F0WATTOVP | \
                       ADCUI_F0STAT_F0VAROVP |  \
                       ADCUI_F0STAT_F0VAOV |    \
                       ADCUI_F0STAT_F0ZXTOF |   \
                       ADCUI_F0STAT_F0APSIGN |  \
                       ADCUI_F0STAT_F0VARSIGN | \
                       ADCUI_F0STAT_F0ZEROCRS | \
                       ADCUI_F0STAT_C3IF_OVR |  \
                       ADCUI_F0STAT_F0WATTOVN | \
                       ADCUI_F0STAT_F0VAROVN)

#define DEINIT_FLAGSx (ADCUI_FxSTAT_FxVF_OVR |  \
                       ADCUI_FxSTAT_FxIF_OVR |  \
                       ADCUI_FxSTAT_FxSAGF |    \
                       ADCUI_FxSTAT_FxPEAKVF |  \
                       ADCUI_FxSTAT_FxPEAKIF |  \
                       ADCUI_FxSTAT_FxWATTOVP | \
                       ADCUI_FxSTAT_FxVAROVP |  \
                       ADCUI_FxSTAT_FxVAOV |    \
                       ADCUI_FxSTAT_FxZXTOF |   \
                       ADCUI_FxSTAT_FxAPSIGN |  \
                       ADCUI_FxSTAT_FxVARSIGN | \
                       ADCUI_FxSTAT_FxZEROCRS | \
                       ADCUI_FxSTAT_FxWATTOVN | \
                       ADCUI_FxSTAT_FxVAROVN)

/** @} */ /* End of the group ADCUI_Private_Defines */

/** @defgroup ADCUI_Exported_Functions ADCUI Exported Functions
 * @{
 */

/**
 * @brief  Deinitialize the ADCUI peripheral registers to their default reset values.
 * @param  None.
 * @return None.
 */
void ADCUI_DeInit(void)
{
    MDR_ADCUI->CTRL1 = 0;
    MDR_ADCUI->CTRL2 = 0xFFFFFF;
    MDR_ADCUI->CTRL3 = 0xFF;

    MDR_ADCUI->F0CTR   = 0;
    MDR_ADCUI->F0WC    = 0;
    MDR_ADCUI->F0VC    = 0;
    MDR_ADCUI->F0AC    = 0;
    MDR_ADCUI->F0MD0   = 0;
    MDR_ADCUI->F0MD1   = 0;
    MDR_ADCUI->F0VPEAK = 0;
    MDR_ADCUI->F0IPEAK = 0;
    MDR_ADCUI->F0STAT  = DEINIT_FLAGS0;
    MDR_ADCUI->F0MASK  = 0;

    MDR_ADCUI->F1CTR   = 0;
    MDR_ADCUI->F1WC    = 0;
    MDR_ADCUI->F1VC    = 0;
    MDR_ADCUI->F1AC    = 0;
    MDR_ADCUI->F1MD0   = 0;
    MDR_ADCUI->F1MD1   = 0;
    MDR_ADCUI->F1VPEAK = 0;
    MDR_ADCUI->F1IPEAK = 0;
    MDR_ADCUI->F1STAT  = DEINIT_FLAGSx;
    MDR_ADCUI->F1MASK  = 0;

    MDR_ADCUI->F2CTR   = 0;
    MDR_ADCUI->F2WC    = 0;
    MDR_ADCUI->F2VC    = 0;
    MDR_ADCUI->F2AC    = 0;
    MDR_ADCUI->F2MD0   = 0;
    MDR_ADCUI->F2MD1   = 0;
    MDR_ADCUI->F2VPEAK = 0;
    MDR_ADCUI->F2IPEAK = 0;
    MDR_ADCUI->F2STAT  = DEINIT_FLAGSx;
    MDR_ADCUI->F2MASK  = 0;

    MDR_ADCUI->CCAL1 = 0;
    MDR_ADCUI->CCAL2 = 0;
    MDR_ADCUI->CCAL3 = 0;
    MDR_ADCUI->CCAL4 = 0;

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    MDR_ADCUI->LOAD = 0;
#endif

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    MDR_ADCUI->MSC       = 0;
    MDR_ADCUI->FILTERCFG = (0x802 << ADCUI_FILTERCFG_CHPF_COEFF_Pos) |
                           (0x803 << ADCUI_FILTERCFG_CLRMS_COEFF_Pos);
    MDR_ADCUI->CLKPHASE1 = (0x200 << ADCUI_CLKPHASE1_I0PHASE_Pos) |
                           (0x200 << ADCUI_CLKPHASE1_I1PHASE_Pos) |
                           (0x200 << ADCUI_CLKPHASE1_I2PHASE_Pos);
    MDR_ADCUI->CLKPHASE2 = (0x200 << ADCUI_CLKPHASE2_I3PHASE_Pos);
#endif
}

/**
 * @brief  Fill each ADCUI_InitStruct member with its default value.
 * @param  ADCUI_InitStruct: The pointer to the @ref ADCUI_InitTypeDef structure
 *         which will be initialized.
 * @return None.
 */
void ADCUI_StructInit(ADCUI_InitTypeDef* ADCUI_InitStruct)
{
    ADCUI_InitStruct->ADCUI_DataResol              = ADCUI_DATA_RESOL_16BIT;
    ADCUI_InitStruct->ADCUI_ZeroCrossLowPassFilter = ADCUI_ZXLPF_FILTER_ENABLE;
    ADCUI_InitStruct->ADCUI_PeriodLength           = ADCUI_PER_LENGTH_1;
    ADCUI_InitStruct->ADCUI_ActivePowerNoLoad      = ADCUI_APNOLOAD_FULL;
    ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad    = ADCUI_VARNOLOAD_FULL;
    ADCUI_InitStruct->ADCUI_FullPowerNoLoad        = ADCUI_VANOLOAD_FULL;
    ADCUI_InitStruct->ADCUI_FreqVEnable            = DISABLE;
    ADCUI_InitStruct->ADCUI_VRefConfig             = ADCUI_REFERENCE_VOLTAGE_EXTERNAL;
    ADCUI_InitStruct->ADCUI_ZeroCrossUpdateRMS     = ADCUI_REG_CONTINUOUS_UPDATE;
    ADCUI_InitStruct->ADCUI_Divider                = ADCUI_OVERSAMPLING_DIV_256;
    ADCUI_InitStruct->ADCUI_VoltageDropLevel       = 0xFFFF;
    ADCUI_InitStruct->ADCUI_VoltageHalfCyclesDrop  = 0xFF;
    ADCUI_InitStruct->ADCUI_ZeroCrossTimeOut       = 0xFFF;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_InitStruct->ADCUI_ClockFrequency = ADCUI_CLK_FREQUENCY_4MHz;
    ADCUI_InitStruct->ADCUI_ChopperPeriod  = ADCUI_CHOPPER_PERIOD_256;
#endif
}

/**
 * @brief  Initialize the ADCUI peripheral according to
 *         the specified parameters in the ADCUI_InitStruct.
 * @param  ADCUI_InitStruct: The pointer to a @ref ADCUI_InitTypeDef structure
 *         that contains the configuration information for the specified ADCUI peripheral.
 * @return None.
 */
void ADCUI_Init(const ADCUI_InitTypeDef* ADCUI_InitStruct)
{
    uint32_t TempCTRL1, TempCTRL2, TempCTRL3;

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    uint32_t TempLOAD = 0;
#endif

