piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_adcui.c
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    uint32_t TempFILTERCFG, TempCLKPHASE1;
#endif

    /* Check the parameters. */
    assert_param(IS_ADCUI_DATA_RESOL(ADCUI_InitStruct->ADCUI_DataResol));
    assert_param(IS_ZXLPF_FILTER(ADCUI_InitStruct->ADCUI_ZeroCrossLowPassFilter));
    assert_param(IS_ADCUI_PER_LENGTH(ADCUI_InitStruct->ADCUI_PeriodLength));
    assert_param(IS_ADCUI_APNOLOAD(ADCUI_InitStruct->ADCUI_ActivePowerNoLoad));
    assert_param(IS_ADCUI_VARNOLOAD(ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad));
    assert_param(IS_ADCUI_VANOLOAD(ADCUI_InitStruct->ADCUI_FullPowerNoLoad));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_InitStruct->ADCUI_FreqVEnable));
    assert_param(IS_ADCUI_REFERENCE_VOLTAGE(ADCUI_InitStruct->ADCUI_VRefConfig));
    assert_param(IS_ADCUI_ZXRMS_REG_UPDATE(ADCUI_InitStruct->ADCUI_ZeroCrossUpdateRMS));
    assert_param(IS_ADCUI_OSR_COF(ADCUI_InitStruct->ADCUI_Divider));
    assert_param(IS_ADCUI_SAGLVL(ADCUI_InitStruct->ADCUI_VoltageDropLevel));
    assert_param(IS_ADCUI_SAGCYC(ADCUI_InitStruct->ADCUI_VoltageHalfCyclesDrop));
    assert_param(IS_ADCUI_ZXTOUT(ADCUI_InitStruct->ADCUI_ZeroCrossTimeOut));
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    assert_param(IS_ADCUI_CLK_FREQUENCY(ADCUI_InitStruct->ADCUI_ClockFrequency));
    assert_param(IS_ADCUI_CHOPPER_PERIOD(ADCUI_InitStruct->ADCUI_ChopperPeriod));
    assert_param(IS_ADCUI_CLK_OSR_VALID(ADCUI_InitStruct->ADCUI_ClockFrequency, ADCUI_InitStruct->ADCUI_Divider));
#endif

    /* Config the ADCUI control1 register. */
    TempCTRL1 = ((uint32_t)ADCUI_InitStruct->ADCUI_DataResol) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_ZeroCrossLowPassFilter) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_PeriodLength) |
#if defined(USE_MDR32F02_REV_1X)
                ((uint32_t)ADCUI_InitStruct->ADCUI_ActivePowerNoLoad) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_FullPowerNoLoad) |
#endif
                ((uint32_t)ADCUI_InitStruct->ADCUI_FreqVEnable << ADCUI_CTRL1_FREQSEL_Pos) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_VRefConfig) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_ZeroCrossUpdateRMS) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_Divider);

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    if ((((uint32_t)ADCUI_InitStruct->ADCUI_ActivePowerNoLoad) & ADCUI_LOAD_APNOLOAD_Msk) != 0) {
        TempLOAD |= ((uint32_t)ADCUI_InitStruct->ADCUI_ActivePowerNoLoad);
    } else {
        TempCTRL1 |= ((uint32_t)ADCUI_InitStruct->ADCUI_ActivePowerNoLoad);
    }
    if ((((uint32_t)ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad) & ADCUI_LOAD_VARNOLOAD_Msk) != 0) {
        TempLOAD |= ((uint32_t)ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad);
    } else {
        TempCTRL1 |= ((uint32_t)ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad);
    }
    if ((((uint32_t)ADCUI_InitStruct->ADCUI_FullPowerNoLoad) &
         (ADCUI_LOAD_VANOLOAD_Msk & ~ADCUI_CTRL1_VANOLOAD_Msk)) != 0) {
        TempLOAD |= ((uint32_t)ADCUI_InitStruct->ADCUI_FullPowerNoLoad);
    } else {
        TempCTRL1 |= ((uint32_t)ADCUI_InitStruct->ADCUI_FullPowerNoLoad);
    }
    MDR_ADCUI->LOAD = TempLOAD;
#endif

    /* Write to the ADCUI control1 register. */
    MDR_ADCUI->CTRL1 = TempCTRL1;

    /* Config the ADCUI control2 register. */
    TempCTRL2 = ((uint32_t)ADCUI_InitStruct->ADCUI_VoltageDropLevel << ADCUI_CTRL2_SAGLVL_Pos) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_VoltageHalfCyclesDrop << ADCUI_CTRL2_SAGCYC_Pos);

    /* Write to the ADCUI control2 register. */
    MDR_ADCUI->CTRL2 = TempCTRL2;

    /* Config the ADCUI control3 register. */
    TempCTRL3 = ((uint32_t)ADCUI_InitStruct->ADCUI_ZeroCrossTimeOut << ADCUI_CTRL3_ZXTOUT_Pos);

    /* Write to the ADCUI control3 register. */
    MDR_ADCUI->CTRL3 = TempCTRL3;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    /* Config the ADCUI FILTERCFG register. */
    TempFILTERCFG = ((uint32_t)ADCUI_InitStruct->ADCUI_ChopperPeriod);

    /* Write to the ADCUI FILTERCFG register. */
    MDR_ADCUI->FILTERCFG |= TempFILTERCFG;

    /* Config the ADCUI CLKPHASE1 register. */
    TempCLKPHASE1 = ((uint32_t)ADCUI_InitStruct->ADCUI_ClockFrequency);

    /* Write to the ADCUI CLKPHASE1 register. */
    MDR_ADCUI->CLKPHASE1 |= TempCLKPHASE1;
#endif
}

/**
 * @brief  Reset the digital unit of the ADCUI blocks.
 * @param  NewState: @ref FunctionalState - a new state of the ADC digital unit.
 * @return None.
 */
void ADCUI_ResetDigital(FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        MDR_ADCUI->CTRL1 |= ADCUI_CTRL1_RESET_DIG;
    } else {
        MDR_ADCUI->CTRL1 &= ~ADCUI_CTRL1_RESET_DIG;
    }
}

/**
 * @brief Initialize the ADCUI Fx peripheral according to
 *        the specified parameters in the ADCUI_FxUnitInitStruct.
 * @param UnitNumber: @ref ADCUI_Unit_TypeDef - a number of the initialized channel.
 * @param ADCUI_FxUnitInitStruct: The pointer to a @ref ADCUI_FxUnit_InitTypeDef
 *        structure that contains the configuration information.
 * @return None.
 */
void ADCUI_Fx_Init(ADCUI_Unit_TypeDef UnitNumber, const ADCUI_FxUnit_InitTypeDef* ADCUI_FxUnitInitStruct)
{
    uint32_t TempFxCTR, TempFxMD0, TempFxWC, TempFxVC, TempFxAC, TempFxMD1, TempCCALx, TempCCAL4;

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    uint32_t TempMSC = 0;
#endif

    /* Check the parameters. */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_INT_STATE(ADCUI_FxUnitInitStruct->ADCUI_Fx_IntegratorEnable));
    assert_param(IS_ADCUI_INT_STATE(ADCUI_FxUnitInitStruct->ADCUI_F0_I3IntegratorEnable));
    assert_param(IS_ADCUI_VASEL(ADCUI_FxUnitInitStruct->ADCUI_SourceRegFullPower));
    assert_param(IS_ADCUI_IGAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain));
    assert_param(IS_ADCUI_VGAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain));
    assert_param(IS_ADCUI_FXPHASE(ADCUI_FxUnitInitStruct->ADCUI_Fx_PhaseShift));
    assert_param(IS_ADCUI_IGAIN(ADCUI_FxUnitInitStruct->ADCUI_F0_I3Gain));
    assert_param(IS_ADCUI_FXVIRMSOS(ADCUI_FxUnitInitStruct->ADCUI_Fx_IRMSCalibration));
    assert_param(IS_ADCUI_FXVIRMSOS(ADCUI_FxUnitInitStruct->ADCUI_Fx_VRMSCalibration));
    assert_param(IS_ADCUI_VDAT_SOURCE(ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceVDAT));
    assert_param(IS_ADCUI_IDAT_SOURCE(ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceIDAT));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBIGainEnable));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBVGainEnable));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_FxUnitInitStruct->ADCUI_F0_6dBI3GainEnable));
    assert_param(IS_ADCUI_F0I3SEL_SELECT(ADCUI_FxUnitInitStruct->ADCUI_F0_I3SelectDataFilter));
    assert_param(IS_ADCUI_CHANNELI_SELECT(ADCUI_FxUnitInitStruct->ADCUI_F0_IChannelSelect));
    assert_param(IS_ADCUI_FXPWROS(ADCUI_FxUnitInitStruct->ADCUI_Fx_ActivePowerOffsetCalibration));
    assert_param(IS_ADCUI_FXPWRGAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_ActivePowerGainCalibration));
    assert_param(IS_ADCUI_FXPWROS(ADCUI_FxUnitInitStruct->ADCUI_Fx_ReactivePowerOffsetCalibration));
    assert_param(IS_ADCUI_FXPWRGAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_ReactivePowerGainCalibration));
    assert_param(IS_ADCUI_FXPWRGAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_FullPowerGainCalibration));
    assert_param(IS_ADCUI_FXVIPKLVL(ADCUI_FxUnitInitStruct->ADCUI_Fx_VPeakLevel));
    assert_param(IS_ADCUI_FXVIPKLVL(ADCUI_FxUnitInitStruct->ADCUI_Fx_IPeakLevel));
    assert_param(IS_ADCUI_CCAL_GAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_IGainCalibration));
    assert_param(IS_ADCUI_CCAL_GAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_VGainCalibration));
    assert_param(IS_ADCUI_CCAL_GAIN(ADCUI_FxUnitInitStruct->ADCUI_F0_I3GainCalibration));
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    assert_param(IS_ADCUI_FxISEL_SELECT(ADCUI_FxUnitInitStruct->ADCUI_Fx_ISelectDataFilter));
#endif

