piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_adcui.c
    /* Configure main registers of the ADCUI Fx unit. */
    TempFxCTR = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IntegratorEnable << ADCUI_FxCTR_FxINTEN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_SourceRegFullPower) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_PhaseShift << ADCUI_FxCTR_FxVPHASE_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IRMSCalibration << ADCUI_FxCTR_FxIRMSOS_Pos);

    TempFxWC = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_ActivePowerOffsetCalibration << ADCUI_FxWC_FxWATTOS_Pos) |
               ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_ActivePowerGainCalibration << ADCUI_FxWC_FxWGAIN_Pos);

    TempFxVC = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_ReactivePowerOffsetCalibration << ADCUI_FxVC_FxVAROS_Pos) |
               ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_ReactivePowerGainCalibration << ADCUI_FxVC_FxVARGAIN_Pos);

    TempFxAC = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_VRMSCalibration << ADCUI_FxAC_FxVRMSOS_Pos) |
               ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_FullPowerGainCalibration << ADCUI_F0AC_F0VAGAIN_Pos);

    TempFxMD0 = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceVDAT) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceIDAT) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBIGainEnable << ADCUI_FxMD0_IxGAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBVGainEnable << ADCUI_FxMD0_VxGAIN_Pos);

    TempFxMD1 = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IPeakLevel << ADCUI_FxMD1_FxIPKLVL_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_VPeakLevel << ADCUI_FxMD1_FxVPKLVL_Pos);

    TempCCALx = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_VGainCalibration << ADCUI_CCALx_VxBGAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IGainCalibration << ADCUI_CCALx_IxBGAIN_Pos);

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            TempFxCTR |= ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3IntegratorEnable << ADCUI_F0CTR_F0I3NTEN_Pos) |
                         ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain << ADCUI_F0CTR_F0I0GAIN_Pos) |
                         ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain << ADCUI_F0CTR_F0VGAIN_Pos) |
                         ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3Gain << ADCUI_F0CTR_F0I3GAIN_Pos);
            TempFxMD0 |= ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_6dBI3GainEnable << ADCUI_F0MD0_I3GAIN_Pos) |
                         ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_IChannelSelect);

            TempFxAC |= ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3SelectDataFilter);

#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
            TempMSC = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_ISelectDataFilter << ADCUI_MSC_F0ISEL_HPF_Pos);
#endif

            TempCCAL4 = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3GainCalibration << ADCUI_CCAL4_I3BGAIN_Pos);
            break;

        case ADCUI_F1_UNIT:
            TempFxCTR |= ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain << ADCUI_FxCTR_FxIGAIN_Pos) |
                         ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain << ADCUI_FxCTR_FxVGAIN_Pos);
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
            TempMSC = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_ISelectDataFilter << ADCUI_MSC_F1ISEL_HPF_Pos);
#endif
            break;

        case ADCUI_F2_UNIT:
            TempFxCTR |= ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain << ADCUI_FxCTR_FxIGAIN_Pos) |
                         ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain << ADCUI_FxCTR_FxVGAIN_Pos);
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
            TempMSC = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_ISelectDataFilter << ADCUI_MSC_F2ISEL_HPF_Pos);
#endif
            break;
        default:
            break;
    }

    /* Write all main registers of the ADCUI Fx unit. */
    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            MDR_ADCUI->F0CTR = TempFxCTR;
            MDR_ADCUI->F0WC  = TempFxWC;
            MDR_ADCUI->F0VC  = TempFxVC;
            MDR_ADCUI->F0AC  = TempFxAC;
            MDR_ADCUI->F0MD0 = TempFxMD0;
            MDR_ADCUI->F0MD1 = TempFxMD1;
            MDR_ADCUI->CCAL1 = TempCCALx;
            MDR_ADCUI->CCAL4 = TempCCAL4;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
            MDR_ADCUI->MSC |= TempMSC;
#endif
            break;
        case ADCUI_F1_UNIT:
            MDR_ADCUI->F1CTR = TempFxCTR;
            MDR_ADCUI->F1WC  = TempFxWC;
            MDR_ADCUI->F1VC  = TempFxVC;
            MDR_ADCUI->F1AC  = TempFxAC;
            MDR_ADCUI->F1MD0 = TempFxMD0;
            MDR_ADCUI->F1MD1 = TempFxMD1;
            MDR_ADCUI->CCAL2 = TempCCALx;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
            MDR_ADCUI->MSC |= TempMSC;
#endif
            break;
        case ADCUI_F2_UNIT:
            MDR_ADCUI->F2CTR = TempFxCTR;
            MDR_ADCUI->F2WC  = TempFxWC;
            MDR_ADCUI->F2VC  = TempFxVC;
            MDR_ADCUI->F2AC  = TempFxAC;
            MDR_ADCUI->F2MD0 = TempFxMD0;
            MDR_ADCUI->F2MD1 = TempFxMD1;
            MDR_ADCUI->CCAL3 = TempCCALx;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
            MDR_ADCUI->MSC |= TempMSC;
#endif
            break;
        default:
            break;
    }
}

/**
 * @brief Fill each ADCUI_FxUnitInitStruct member with its default value.
 * @param ADCUI_FxUnitInitStruct: The pointer to a @ref ADCUI_FxUnit_InitTypeDef
 *        structure which is to be initialized.
 * @return None.
 */
void ADCUI_Fx_StructInit(ADCUI_FxUnit_InitTypeDef* ADCUI_FxUnitInitStruct)
{
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IntegratorEnable   = ADCUI_INT_ENABLE;
    ADCUI_FxUnitInitStruct->ADCUI_F0_I3IntegratorEnable = ADCUI_INT_ENABLE;
    ADCUI_FxUnitInitStruct->ADCUI_SourceRegFullPower    = ADCUI_FULL_ENERGY;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain = ADCUI_IGAIN_6dB;
#endif
#if defined(USE_MDR32F02_REV_1X) || defined(USE_MDR32F02_REV_2)
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain = ADCUI_IGAIN_0dB;
#endif
    ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain      = ADCUI_VGAIN_0dB;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_PhaseShift = 0;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_FxUnitInitStruct->ADCUI_F0_I3Gain = ADCUI_IGAIN_6dB;
#endif
#if defined(USE_MDR32F02_REV_1X) || defined(USE_MDR32F02_REV_2)
    ADCUI_FxUnitInitStruct->ADCUI_F0_I3Gain = ADCUI_IGAIN_0dB;
#endif
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IRMSCalibration                = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_VRMSCalibration                = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceVDAT                     = ADCUI_Fx_VDAT_U_BEFORE_HPF;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceIDAT                     = ADCUI_Fx_IDAT_I;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBIGainEnable                 = DISABLE;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBVGainEnable                 = DISABLE;
    ADCUI_FxUnitInitStruct->ADCUI_F0_6dBI3GainEnable                = DISABLE;
    ADCUI_FxUnitInitStruct->ADCUI_F0_I3SelectDataFilter             = ADCUI_F0I3SEL_AFTER_HPF;
    ADCUI_FxUnitInitStruct->ADCUI_F0_IChannelSelect                 = ADCUI_F0_I_CH_AUTO;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_ActivePowerOffsetCalibration   = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_ActivePowerGainCalibration     = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_ReactivePowerOffsetCalibration = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_ReactivePowerGainCalibration   = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_FullPowerGainCalibration       = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_VPeakLevel                     = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IPeakLevel                     = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IGainCalibration               = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_VGainCalibration               = 0;
    ADCUI_FxUnitInitStruct->ADCUI_F0_I3GainCalibration              = 0;
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
    ADCUI_FxUnitInitStruct->ADCUI_Fx_ISelectDataFilter = ADCUI_FxISEL_BEFORE_HPF;
#endif
}

/**
 * @brief Clear the ADCUI power counter for specified Fx unit.
 * @param UnitNumber: @ref ADCUI_Unit_TypeDef - a number of the channel.
 * @param PowerCounter: @ref ADCUI_Power_TypeDef - a selected power counter to clear.
 * @return None.
 */
void ADCUI_Fx_ClearPowerCounter(ADCUI_Unit_TypeDef UnitNumber, ADCUI_Power_TypeDef PowerCounter)
{
    /* Check the parameters. */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_POWERS(PowerCounter));

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            switch (PowerCounter) {
                case ADCUI_POWER_ACTIVE:
                    MDR_ADCUI->F0CTR |= (1 << ADCUI_F0CTR_F0RARS_Pos);
                    break;
                case ADCUI_POWER_REACTIVE:
                    MDR_ADCUI->F0CTR |= (1 << ADCUI_F0CTR_F0RRRS_Pos);
                    break;
                case ADCUI_POWER_FULL:
                    MDR_ADCUI->F0CTR |= (1 << ADCUI_F0CTR_F0RVRS_Pos);
                    break;
            }
            break;
        case ADCUI_F1_UNIT:
            switch (PowerCounter) {
                case ADCUI_POWER_ACTIVE:
                    MDR_ADCUI->F1CTR |= (1 << ADCUI_FxCTR_FxRARS_Pos);
                    break;
                case ADCUI_POWER_REACTIVE:
                    MDR_ADCUI->F1CTR |= (1 << ADCUI_FxCTR_FxRRRS_Pos);
                    break;
                case ADCUI_POWER_FULL:
                    MDR_ADCUI->F1CTR |= (1 << ADCUI_FxCTR_FxRVRS_Pos);
                    break;
            }
            break;
        case ADCUI_F2_UNIT:
            switch (PowerCounter) {
                case ADCUI_POWER_ACTIVE:
                    MDR_ADCUI->F2CTR |= (1 << ADCUI_FxCTR_FxRARS_Pos);
                    break;
                case ADCUI_POWER_REACTIVE:
                    MDR_ADCUI->F2CTR |= (1 << ADCUI_FxCTR_FxRRRS_Pos);
                    break;
                case ADCUI_POWER_FULL:
                    MDR_ADCUI->F2CTR |= (1 << ADCUI_FxCTR_FxRVRS_Pos);
                    break;
            }
            break;
        default:
            break;
    }
}

/**
 * @brief  ADCUI channel configuration.
 * @param  Channels: @ref ADCUI_Channel_TypeDef - specify the ADCUI channel to be enabled or disabled.
 * @param  NewState: @ref FunctionalState - the new states of the specified ADCUI channels.
 * @return None.
 */
void ADCUI_ChannelConfig(uint32_t Channels, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNELS(Channels));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

