piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_adcui.c
    if (NewState != DISABLE) {
        MDR_ADCUI->CTRL1 |= Channels;
    } else {
        MDR_ADCUI->CTRL1 &= ~Channels;
    }
}

/**
 * @brief  Selecting DMA operating mode (single or block transactions).
 * @param  Channels: @ref ADCUI_Channel_TypeDef - specify the ADCUI channel to be enabled or disabled.
 * @param  Mode: @ref ADCUI_DmaTransMode_TypeDef - specify DMA transaction mode.
 * @param  NewState: @ref FunctionalState - the new states of the specified ADCUI channels when configuring the DMA operating mode.
 * @return None.
 */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
void ADCUI_DMAConfig(uint32_t Channels, ADCUI_DmaTransMode_TypeDef Mode, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNELS(Channels));
    assert_param(IS_ADCUI_DMA_TRANSACTIONS_MODE(Mode));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    switch (Mode) {
        case ADCUI_DMA_TRANSACTIONS_SINGLE:
            if (NewState != DISABLE) {
                MDR_ADCUI->MSC |= (Channels << ADCUI_MSC_DMA_EN_RQ_S_Pos);
            } else {
                MDR_ADCUI->MSC &= (~Channels << ADCUI_MSC_DMA_EN_RQ_S_Pos);
            }
            break;
        case ADCUI_DMA_TRANSACTIONS_BLOCK:
            if (NewState != DISABLE) {
                MDR_ADCUI->MSC |= Channels;
            } else {
                MDR_ADCUI->MSC &= ~Channels;
            }
            break;
        default:
            break;
    }
}
#endif

/**
 * @brief  ADCUI chopper configuration.
 * @param  ChannelNumber: @ref ADCUI_Channel_TypeDef - specify the ADCUI channel in which you want to enable or disable the chopper.
 * @param  NewState: @ref FunctionalState - the new states of the specified ADCUI channels for working with chopper.
 * @return None.
 */
#if defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
void ADCUI_ChopperConfig(ADCUI_Channel_TypeDef ChannelNumber, FunctionalState NewState)
{
    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNELS(ChannelNumber));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE) {
        switch (ChannelNumber) {
            case ADCUI_CH_F0_I0:
                MDR_ADCUI->CTRL2 |= (1 << ADCUI_CTRL2_DCHPENI0_Pos);
                break;
            case ADCUI_CH_F0_V0:
                MDR_ADCUI->CTRL2 |= (1 << ADCUI_CTRL2_DCHPENV0_Pos);
                break;
            case ADCUI_CH_F1_I1:
                MDR_ADCUI->CTRL2 |= (1 << ADCUI_CTRL2_DCHPENI1_Pos);
                break;
            case ADCUI_CH_F1_V1:
                MDR_ADCUI->CTRL2 |= (1 << ADCUI_CTRL2_DCHPENV1_Pos);
                break;
            case ADCUI_CH_F2_I2:
                MDR_ADCUI->CTRL2 |= (1 << ADCUI_CTRL2_DCHPENI2_Pos);
                break;
            case ADCUI_CH_F2_V2:
                MDR_ADCUI->CTRL2 |= (1 << ADCUI_CTRL2_DCHPENV2_Pos);
                break;
            case ADCUI_CH_F0_I3:
                MDR_ADCUI->CTRL2 |= (1 << ADCUI_CTRL2_DCHPENI3_Pos);
                break;
            default:
                break;
        }
    } else {
        switch (ChannelNumber) {
            case ADCUI_CH_F0_I0:
                MDR_ADCUI->CTRL2 &= ~((uint32_t)1 << ADCUI_CTRL2_DCHPENI0_Pos);
                break;
            case ADCUI_CH_F0_V0:
                MDR_ADCUI->CTRL2 &= ~((uint32_t)1 << ADCUI_CTRL2_DCHPENV0_Pos);
                break;
            case ADCUI_CH_F1_I1:
                MDR_ADCUI->CTRL2 &= ~((uint32_t)1 << ADCUI_CTRL2_DCHPENI1_Pos);
                break;
            case ADCUI_CH_F1_V1:
                MDR_ADCUI->CTRL2 &= ~((uint32_t)1 << ADCUI_CTRL2_DCHPENV1_Pos);
                break;
            case ADCUI_CH_F2_I2:
                MDR_ADCUI->CTRL2 &= ~((uint32_t)1 << ADCUI_CTRL2_DCHPENI2_Pos);
                break;
            case ADCUI_CH_F2_V2:
                MDR_ADCUI->CTRL2 &= ~((uint32_t)1 << ADCUI_CTRL2_DCHPENV2_Pos);
                break;
            case ADCUI_CH_F0_I3:
                MDR_ADCUI->CTRL2 &= ~((uint32_t)1 << ADCUI_CTRL2_DCHPENI3_Pos);
                break;
            default:
                break;
        }
    }
}
#endif

/**
 * @brief  Return the result of the operation for the specified ADCUI channel.
 * @param  ChannelNumber: @ref ADCUI_Channel_TypeDef - ADCUI channel number.
 * @return A value of the ADCUI result register for the specified channel.
 */
uint32_t ADCUI_GetResult(ADCUI_Channel_TypeDef ChannelNumber)
{
    uint32_t ResultChannel = 0;

    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNEL(ChannelNumber));

    switch (ChannelNumber) {
        case ADCUI_CH_F0_I0:
            ResultChannel = MDR_ADCUI->F0I0DAT;
            break;
        case ADCUI_CH_F0_V0:
            ResultChannel = MDR_ADCUI->F0VDAT;
            break;
        case ADCUI_CH_F1_I1:
            ResultChannel = MDR_ADCUI->F1IDAT;
            break;
        case ADCUI_CH_F1_V1:
            ResultChannel = MDR_ADCUI->F1VDAT;
            break;
        case ADCUI_CH_F2_I2:
            ResultChannel = MDR_ADCUI->F2IDAT;
            break;
        case ADCUI_CH_F2_V2:
            ResultChannel = MDR_ADCUI->F2VDAT;
            break;
        case ADCUI_CH_F0_I3:
            ResultChannel = MDR_ADCUI->F0I3DAT;
            break;
        default:
            break;
    }
    return (ResultChannel);
}

/**
 * @brief  Return the ADCUI power accumulator for a specified Fx unit.
 * @param  UnitNumber: @ref ADCUI_Unit_TypeDef - select ADCUI Fx unit.
 * @param  PowerAccumulator: @ref ADCUI_Power_TypeDef - power accumulator.
 * @param  ReturnNegative: @ref FunctionalState - return negative power. Count only for active and reactive power.
 * @return ADCUI power accumulator value.
 */
uint64_t ADCUI_GetPowerAccumulator(ADCUI_Unit_TypeDef  UnitNumber,
                                   ADCUI_Power_TypeDef PowerAccumulator,
                                   FunctionalState     ReturnNegative)
{
    volatile uint32_t *PtrPowerLow, *PtrPowerHigh;
    uint32_t           PowerLow, PowerHigh;

    volatile uint32_t* PowersArray[30] = {
        &(MDR_ADCUI->F0WATTP), &(MDR_ADCUI->F0WATTP_L), &(MDR_ADCUI->F0WATTN), &(MDR_ADCUI->F0WATTN_L),
        &(MDR_ADCUI->F0VARP), &(MDR_ADCUI->F0VARP_L), &(MDR_ADCUI->F0VARN), &(MDR_ADCUI->F0VARN_L),
        &(MDR_ADCUI->F0VARP), &(MDR_ADCUI->F0VR_L),
        &(MDR_ADCUI->F1WATTP), &(MDR_ADCUI->F1WATTP_L), &(MDR_ADCUI->F1WATTN), &(MDR_ADCUI->F1WATTN_L),
        &(MDR_ADCUI->F1VARP), &(MDR_ADCUI->F1VARP_L), &(MDR_ADCUI->F1VARN), &(MDR_ADCUI->F1VARN_L),
        &(MDR_ADCUI->F1VARP), &(MDR_ADCUI->F1VR_L),
        &(MDR_ADCUI->F2WATTP), &(MDR_ADCUI->F2WATTP_L), &(MDR_ADCUI->F2WATTN), &(MDR_ADCUI->F2WATTN_L),
        &(MDR_ADCUI->F2VARP), &(MDR_ADCUI->F2VARP_L), &(MDR_ADCUI->F2VARN), &(MDR_ADCUI->F2VARN_L),
        &(MDR_ADCUI->F2VARP), &(MDR_ADCUI->F2VR_L)
    };

    /* Check the parameters. */
    assert_param(IS_ADCUI_POWER(PowerAccumulator));
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_FUNCTIONAL_STATE(ReturnNegative));

    if (PowerAccumulator == ADCUI_POWER_FULL) {
        ReturnNegative = DISABLE;
    }

