piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/src/MDR32VF0xI_adcui.c
    PtrPowerLow  = (PowersArray[((uint32_t)UnitNumber * 10) +
                               ((uint32_t)PowerAccumulator * 4) +
                               ((uint32_t)ReturnNegative * 2) + 1]);
    PtrPowerHigh = (PowersArray[((uint32_t)UnitNumber * 10) +
                                ((uint32_t)PowerAccumulator * 4) +
                                ((uint32_t)ReturnNegative * 2)]);

    do {
        PowerHigh = *PtrPowerHigh;
        PowerLow  = *PtrPowerLow;
    } while (PowerHigh != *PtrPowerHigh);

    return (uint64_t)(((uint64_t)PowerHigh << 32) | PowerLow);
}

/**
 * @brief  Return the peak value for a specific channel.
 * @param  ChannelNumber: @ref ADCUI_Channel_TypeDef - a channel number.
 *         This parameter should be one of the following values:
 *             @arg ADCUI_CH_F0_I0: I0 channel of F0 unit.
 *             @arg ADCUI_CH_F0_V0: V0 channel of F0 unit.
 *             @arg ADCUI_CH_F1_I1: I1 channel of F1 unit.
 *             @arg ADCUI_CH_F1_V1: V1 channel of F1 unit.
 *             @arg ADCUI_CH_F2_I2: I2 channel of F2 unit.
 *             @arg ADCUI_CH_F2_V2: V2 channel of F2 unit.
 * @return ADCUI peak value for a specified channel.
 */
uint32_t ADCUI_GetPeakValue(ADCUI_Channel_TypeDef ChannelNumber)
{
    uint32_t Value = 0;

    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNEL_NO_I3(ChannelNumber));

    switch (ChannelNumber) {
        case ADCUI_CH_F0_I0:
            Value = MDR_ADCUI->F0IPEAK;
            break;
        case ADCUI_CH_F0_V0:
            Value = MDR_ADCUI->F0VPEAK;
            break;
        case ADCUI_CH_F1_I1:
            Value = MDR_ADCUI->F1IPEAK;
            break;
        case ADCUI_CH_F1_V1:
            Value = MDR_ADCUI->F1VPEAK;
            break;
        case ADCUI_CH_F2_I2:
            Value = MDR_ADCUI->F2IPEAK;
            break;
        case ADCUI_CH_F2_V2:
            Value = MDR_ADCUI->F2VPEAK;
            break;
        default:
            break;
    }
    return Value;
}

/**
 * @brief  Clear the peak value for a specified channel.
 * @param  ChannelNumber: @ref ADCUI_Channel_TypeDef - a channel number.
 *         This parameter should be one of the following values:
 *             @arg ADCUI_CH_F0_I0: I0 channel of F0 unit.
 *             @arg ADCUI_CH_F0_V0: V0 channel of F0 unit.
 *             @arg ADCUI_CH_F1_I1: I1 channel of F1 unit.
 *             @arg ADCUI_CH_F1_V1: V1 channel of F1 unit.
 *             @arg ADCUI_CH_F2_I2: I2 channel of F2 unit.
 *             @arg ADCUI_CH_F2_V2: V2 channel of F2 unit.
 * @return None.
 */
void ADCUI_ClearPeakValue(ADCUI_Channel_TypeDef ChannelNumber)
{
    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNEL_NO_I3(ChannelNumber));

    switch (ChannelNumber) {
        case ADCUI_CH_F0_I0:
            MDR_ADCUI->F0IPEAK = 0;
            break;
        case ADCUI_CH_F0_V0:
            MDR_ADCUI->F0VPEAK = 0;
            break;
        case ADCUI_CH_F1_I1:
            MDR_ADCUI->F1IPEAK = 0;
            break;
        case ADCUI_CH_F1_V1:
            MDR_ADCUI->F1VPEAK = 0;
            break;
        case ADCUI_CH_F2_I2:
            MDR_ADCUI->F2IPEAK = 0;
            break;
        case ADCUI_CH_F2_V2:
            MDR_ADCUI->F2VPEAK = 0;
            break;
        default:
            break;
    }
}

/**
 * @brief   Return RMS value for a specified channel.
 * @param   ChannelNumber: @ref ADCUI_Channel_TypeDef - a channel number.
 *          This parameter should be one of the following values:
 *              @arg ADCUI_CH_F0_I0: I0 channel of F0 unit.
 *              @arg ADCUI_CH_F0_V0: V0 channel of F0 unit.
 *              @arg ADCUI_CH_F1_I1: I1 channel of F1 unit.
 *              @arg ADCUI_CH_F1_V1: V1 channel of F1 unit.
 *              @arg ADCUI_CH_F2_I2: I2 channel of F2 unit.
 *              @arg ADCUI_CH_F2_V2: V2 channel of F2 unit.
 *              @arg ADCUI_CH_F0_I3: I3 channel of F0 unit. For an inactive channel, which may be I0 or I3
 *                                    depending on F0MD0.F0SEL_I_CH bits.
 * @warning ChannelNumber == ADCUI_CH_F0_I3 corresponds to an inactive channel,
 *          which may be I0 or I3 depending on F0MD0.F0SEL_I_CH bits.
 * @return  ADCUI RMS value for a specified channel.
 */
uint32_t ADCUI_GetRMS(ADCUI_Channel_TypeDef ChannelNumber)
{
    uint32_t Value = 0;

    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNEL(ChannelNumber));

    switch (ChannelNumber) {
        case ADCUI_CH_F0_I0:
            Value = MDR_ADCUI->F0IRMS;
            break;
        case ADCUI_CH_F0_V0:
            Value = MDR_ADCUI->F0VRMS;
            break;
        case ADCUI_CH_F1_I1:
            Value = MDR_ADCUI->F1IRMS;
            break;
        case ADCUI_CH_F1_V1:
            Value = MDR_ADCUI->F1VRMS;
            break;
        case ADCUI_CH_F2_I2:
            Value = MDR_ADCUI->F2IRMS;
            break;
        case ADCUI_CH_F2_V2:
            Value = MDR_ADCUI->F2VRMS;
            break;
        case ADCUI_CH_F0_I3:
            Value = MDR_ADCUI->F0IRMS_INACTIVE;
            break;
        default:
            break;
    }
    return Value;
}

/**
 * @brief  Return RMS^2 value for a specified channel.
 * @param  ChannelNumber: @ref ADCUI_Channel_TypeDef - a channel number.
 *         This parameter should be one of the following values:
 *             @arg ADCUI_CH_F0_I0: I0 channel of F0 unit.
 *             @arg ADCUI_CH_F0_V0: V0 channel of F0 unit.
 *             @arg ADCUI_CH_F1_I1: I1 channel of F1 unit.
 *             @arg ADCUI_CH_F1_V1: V1 channel of F1 unit.
 *             @arg ADCUI_CH_F2_I2: I2 channel of F2 unit.
 *             @arg ADCUI_CH_F2_V2: V2 channel of F2 unit.
 * @return ADCUI RMS^2 value for a specified channel.
 */
uint32_t ADCUI_GetRMS2(ADCUI_Channel_TypeDef ChannelNumber)
{
    uint32_t Value = 0;

    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNEL_NO_I3(ChannelNumber));

    switch (ChannelNumber) {
        case ADCUI_CH_F0_I0:
            Value = MDR_ADCUI->F0IRMS2;
            break;
        case ADCUI_CH_F0_V0:
            Value = MDR_ADCUI->F0VRMS2;
            break;
        case ADCUI_CH_F1_I1:
            Value = MDR_ADCUI->F1IRMS2;
            break;
        case ADCUI_CH_F1_V1:
            Value = MDR_ADCUI->F1VRMS2;
            break;
        case ADCUI_CH_F2_I2:
            Value = MDR_ADCUI->F2IRMS2;
            break;
        case ADCUI_CH_F2_V2:
            Value = MDR_ADCUI->F2VRMS2;
            break;
        default:
            break;
    }
    return Value;
}

/**
 * @brief  Return a phase shift of V1 or V2 channels in relation to V0.
 * @param  ChannelNumber: @ref ADCUI_Channel_TypeDef - a channel number.
 *         This parameter should be one of the following values:
 *             @arg ADCUI_CH_F1_V1: V1 channel of F1 unit.
 *             @arg ADCUI_CH_F2_V2: V2 channel of F2 unit.
 * @return ADCUI phase shift of a specified voltage channel in relation to V0.
 */
uint32_t ADCUI_GetVPhaseShiftRelativeV0(ADCUI_Channel_TypeDef ChannelNumber)
{
    uint32_t Value;

    /* Check the parameters. */
    assert_param(IS_ADCUI_CHANNEL_V1_V2(ChannelNumber));

    if (ChannelNumber == ADCUI_CH_F1_V1) {
        Value = MDR_ADCUI->F1MD2;
    } else {
        Value = MDR_ADCUI->F2MD2;
    }

    return Value;
}

#if defined(USE_MDR32F02_REV_2) || defined(USE_MDR1206FI) || defined(USE_MDR1206AFI) || defined(USE_MDR1206)
/**
 * @brief  Return ADCUI effective value of the voltage in the channel period.
 * @param  UnitNumber: @ref ADCUI_Unit_TypeDef - select an ADCUI Fx unit.
 * @return ADCUI voltage effective value.
 */
uint32_t ADCUI_GetVoltageTrueRMS(ADCUI_Unit_TypeDef UnitNumber)
{
    uint32_t Result = 0;

    /* Check the parameters. */
    assert_param(IS_ADCUI_UNIT(UnitNumber));

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            Result = MDR_ADCUI->F0VRMS_TRUE;
            break;
        case ADCUI_F1_UNIT:
            Result = MDR_ADCUI->F1VRMS_TRUE;
            break;
        case ADCUI_F2_UNIT:
            Result = MDR_ADCUI->F2VRMS_TRUE;
            break;
        default:
            break;
    }
    return Result;
}
#endif

/**
 * @brief  Reset certain flags in one of ADCUI units.
 * @param  UnitNumber: @ref ADCUI_Unit_TypeDef - select an ADCUI Fx unit.
 * @param  Flags: Specify the flags to clear.
 *         This parameter can be any combination of @ref ADCUI_Flags_TypeDef values.
 * @return None.
 */
void ADCUI_ClearFlags(ADCUI_Unit_TypeDef UnitNumber, uint32_t Flags)
{
    /* Check the parameters. */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_FLAG(Flags));

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            MDR_ADCUI->F0STAT |= Flags;
            break;
        case ADCUI_F1_UNIT:
            MDR_ADCUI->F1STAT |= Flags;
            break;
        case ADCUI_F2_UNIT:
            MDR_ADCUI->F2STAT |= Flags;
            break;
        default:
            break;
    }
}

/**
 * @brief  Check whether a specified ADCUI flag is set or not.
 * @param  UnitNumber: @ref ADCUI_Unit_TypeDef - select an ADCUI Fx unit.
 * @param  ADCUI_Flag: @ref ADCUI_Flags_TypeDef - specify a flag to check.
 * @return @ref FlagStatus - a state of ADCUI flag (SET or RESET).
 */
FlagStatus ADCUI_GetFlagStatus(ADCUI_Unit_TypeDef UnitNumber, ADCUI_Flags_TypeDef ADCUI_Flag)
{
    FlagStatus Flag = RESET;

    /* Check the parameters. */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_FLAG(ADCUI_Flag));

    switch (UnitNumber) {

